---
title: StairsComponentConnection
classe: Autodesk.Revit.DB.Architecture.StairsComponentConnection
namespace: Autodesk.Revit.DB.Architecture
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# StairsComponentConnection

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `StairsComponentConnectionEndType ConnectionType { get; }` | `stairsComponentConnection.ConnectionType` | StairsComponentConnectionEndType |
| `ElementId ElementId { get; }` | `stairsComponentConnection.ElementId` | ElementId |
| `Boolean IsValidObject { get; }` | `stairsComponentConnection.IsValidObject` | Boolean |
| `StairsComponentConnectionEndType PeerConnectionType { get; }` | `stairsComponentConnection.PeerConnectionType` | StairsComponentConnectionEndType |
| `ElementId PeerElementId { get; }` | `stairsComponentConnection.PeerElementId` | ElementId |
| `Void Dispose()` | `stairsComponentConnection.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```